{
    "data": {
        "proposals": [
            {
                "id": "0x45513bb63946582432afa7213bcb2677e877dabbd5722210efd5eaf45797031c",
                "ipfs": "bafkreieb46ua4l3npaeslkesmnb3t3e5gjrmjrybi6cfodacno6sthipxy",
                "space": {
                    "id": "arbitrumfoundation.eth",
                    "name": "Arbitrum DAO",
                    "avatar": "ipfs://bafkreiejp7kjzjm4mlck45xcfup5lha7wrgqlyghvrtvpjpu5sfb6rl2ei",
                    "network": "42161",
                    "admins": [],
                    "moderators": [
                        "0xd6ca0daa6115bdf4577f26c9fa88f048d15e3ef9"
                    ],
                    "symbol": "ARB",
                    "terms": null
                },
                "type": "basic",
                "title": "Request to Increase the Stylus Sprint Committee's Budget",
                "body": "### Non-Constitutional\n\n## Abstract\n\n* The Stylus Sprint program saw overwhelming demand, with 147 applications requesting ~31.92 million ARB, significantly exceeding the initial budget.\n* This proposal requests an **additional 4 million ARB** to extend the committee’s original budget. The funds will enable the evaluation committee to fund a set of exceptional applications that were excluded due to budget constraints.\n* The committee has provided the list of applicants that it strongly recommends deserve to be funded as part of the Sprint, in addition to the 5M ARB already [allocated](https://forum.arbitrum.foundation/t/stylus-sprint-results-announcing-the-accepted-applications/28294). Rationale and a summary of the applicants is linked in the proposal.\n* We will be moving this request to **Snapshot next Thursday, February 6th**. If approved, an onchain vote will move forward the following Thursday as to not further disrupt the proposed timelines of the applicants.\n\n## Motivation/Rationale\n\nWith 147 applications and ~31.92 million ARB in funding requests, demand for the Stylus Sprint program significantly exceeded expectations. The committee received a large number of exceptional applications, but unfortunately, due to the initial budget constraints, the committee was only able to fund 17 applications. They were chosen based on a combination of factors including cost, timeline, necessity for immediate start, RFP category importance, and the priority to fund both applications and infrastructure/tooling.\n\nWhile the committee has [accepted](https://forum.arbitrum.foundation/t/stylus-sprint-results-announcing-the-accepted-applications/28294) a subset of the applicants, there remains an important opportunity to support impactful ideas and high-quality teams. With Stylus as one of Arbitrum’s strongest competitive advantages, the committee strongly believes that enabling all impressive applications received as a part of the Stylus Sprint with funding is a worthwhile investment for the DAO.\n\nThis proposal seeks an additional allocation of 4 million ARB tokens to extend funding opportunities to promising projects that were not initially accepted into the Sprint. With this budget extension, the committee will be able to fund an additional group of applicants, outlined in detail below. While there are many more strong applications, the recommended list scored especially high during the review process and are ones that the committee is confident have the potential to provide value to the Arbitrum and Stylus ecosystems.\n\n## Specifications\n\nAs stated in the original Stylus Sprint proposal, large requests may be directed to the DAO directly to request funding. This process was communicated to applicants, some of which elected to go this route over reducing their request. The smaller applicants in this list are in the committee’s opinion worthwhile investments that have the potential to improve Stylus long-term.\n\nThe following list of applicants are the ones that come with a strong recommendation from the committee and to reiterate were unable to be accepted due to budget constraints.\n\nOpen Application\n\n1. [Pyth Oracle Implementation in Stylus](https://questbook.app/dashboard/?grantId=671a105a2047c84bb8a73770&chainId=10&proposalId=677ead288f4a6bf40504bf73&isRenderingProposalBody=true) - ARB Requested: 1,000,000\n2. [Sylow](https://questbook.app/dashboard/?grantId=671a105a2047c84bb8a73770&chainId=10&proposalId=6736959690449961f536371f&isRenderingProposalBody=true) - ARB Requested: 700,000\n3. [Nuffle Labs](https://questbook.app/dashboard/?grantId=671a105a2047c84bb8a73770&chainId=10&proposalId=675080fe90449961f5919181&isRenderingProposalBody=true) - ARB Requested: 500,000\n4. [Syndicate MintVM](https://questbook.app/dashboard/?grantId=671a105a2047c84bb8a73770&chainId=10&proposalId=677c5c2bfaef5017a82a1d09&isRenderingProposalBody=true) - ARB Requested: 210,000\n5. [Ember: LP Optimization with Volatility-based Dynamic Fees](https://questbook.app/dashboard/?grantId=671a105a2047c84bb8a73770&chainId=10&proposalId=677b6194faef5017a81d9e61&isRenderingProposalBody=true) - ARB Requested: 100,000\n\nRFP Track\n\n1. [Moving Stylus: Move to Stylus-compatible WASM compiler](https://questbook.app/dashboard/?grantId=671a105a2047c84bb8a73770&chainId=10&proposalId=677b5396faef5017a81d67fb&isRenderingProposalBody=true) - ARB Requested: 450,000\n2. [Trail of Bits: Add Stylus as a Solang compiler target](https://questbook.app/dashboard/?grantId=671a105a2047c84bb8a73770&chainId=10&proposalId=6771b86f8f4a6bf405ad6d8c&isRenderingProposalBody=true) - ARB Requested: 440,000\n3. [StylusFuzz: Advanced Property Testing for WASM Contracts](https://questbook.app/dashboard/?grantId=671a105a2047c84bb8a73770&chainId=10&proposalId=674fb60d902931f05c15e3c9&isRenderingProposalBody=true) - ARB Requested: 408,200\n4. [CodeTracer](https://questbook.app/dashboard/?grantId=671a105a2047c84bb8a73770&chainId=10&proposalId=6767477ffaef5017a89b48a2&isRenderingProposalBody=true) - ARB Requested: 250,000\n\nRationale and a summary of each applicant’s proposed scope can be found in this [document](https://docs.google.com/document/d/17YvYmIuYI0Yx0IKrjVL1epDEGRChLRYNnSlkFU-IEKw/edit?usp=sharing).\n\nIt is important to note that the decision to include the above applicants is based on the finalized version of their submission that was reviewed during the grading period.\n\nDue to the open nature of the DAO, applicants not included in this recommendation maintain the ability to move their request directly to the forums in case they feel like they have a compelling case despite the non-acceptance from the committee, effectively circumventing the Stylus Sprint and evaluation committee. The committee is aware of some applicants that may bring revised versions and/or lower budgets than when they were originally reviewed. While we appreciate that Arbitrum DAO’s open and decentralized essence provides the freedom to make such requests, we’d encourage delegates to be mindful of the possible precedent funding projects circumventing the program would set. When appropriate, the committee has already directed certain applications to be on the look out for alternative DAO programs, such as the Season 3 of [Arbitrum D.A.O](https://forum.arbitrum.foundation/t/non-constitutional-rfc-arbitrum-d-a-o-domain-allocator-offerings-grant-program-season-3/27584) program if it's approved.\n\nIf this proposed extension is approved on Snapshot, we will move it immediately to an onchain vote the following Thursday, February 20th. The recommended applicants will be held to the current Stylus Sprint timeline, so the committee would like to not unnecessarily delay the ability to fund these projects. Projects funded as part of the Stylus Sprint’s budget increase will benefit from the infrastructure already in place as far as MSS/payments and milestone reviews by the evaluation committee.\n\nThe Snapshot vote will be a basic vote with For, Against, and Abstain as options.\n\n## Budget\n\nThe Stylus Sprint committee is requesting an **additional 4,000,000 ARB** to extend its Stylus Sprint budget. If approved, the funds will be sent to the existing MSS-controlled Stylus Sprint multisig.\n\n## Timeline\n\n**January 30th:** Forum Post\n**February 6-13th:** Snapshot Vote\n**February 20th - March 6th:** Tally Vote\n**March 9th:** Funds delivered to Stylus Sprint multisig\n**March 10th:** Recommended teams join the Stylus Sprint\n\n## Conflicts of Interest\n\nEntropy and the committee have no conflicts of interest associated with the recommended applicants or this proposal requesting an extension of funds.",
                "discussion": "https://forum.arbitrum.foundation/t/request-to-increase-the-stylus-sprint-committee-s-budget/28312?u=entropy",
                "author": "0xb4c064f466931B8d0F637654c916E3F203c46f13",
                "quorum": 0,
                "quorumType": "default",
                "start": 1738868146,
                "end": 1739472946,
                "snapshot": 303324753,
                "choices": [
                    "For",
                    "Against",
                    "Abstain"
                ],
                "labels": [],
                "scores": [
                    25118768.284151353,
                    54861.69286294813,
                    89457.39828064373
                ],
                "scores_total": 25263087.37529494,
                "scores_state": "pending",
                "state": "active",
                "strategies": [
                    {
                        "name": "erc20-votes",
                        "params": {
                            "symbol": "ARB",
                            "address": "0x912CE59144191C1204E64559FE8253a0e49E6548",
                            "decimals": 18
                        },
                        "network": "42161"
                    }
                ],
                "created": 1738868146,
                "updated": null,
                "votes": 1607,
                "privacy": "",
                "plugins": {},
                "flagged": false
            },
            {
                "id": "0xbd77b4faf99e06c7b4117e5dafaf5bb8f873bcffbb5c9d414a7ff745b6849f3a",
                "ipfs": "bafkreif3uzhpjxm2jpxwt5pfr6h4vytfzx2hn5indfordpbragpfqxs7pq",
                "space": {
                    "id": "arbitrumfoundation.eth",
                    "name": "Arbitrum DAO",
                    "avatar": "ipfs://bafkreiejp7kjzjm4mlck45xcfup5lha7wrgqlyghvrtvpjpu5sfb6rl2ei",
                    "network": "42161",
                    "admins": [],
                    "moderators": [
                        "0xd6ca0daa6115bdf4577f26c9fa88f048d15e3ef9"
                    ],
                    "symbol": "ARB",
                    "terms": null
                },
                "type": "basic",
                "title": "Approve the Nova Fee Sweep Action",
                "body": "## Abstract\nThe Nova Fee Sweep action applies to historical Nova transaction fees currently held in the [L1TimelockAlias](https://nova.arbiscan.io/address/0xf7951d92b0c345144506576ec13ecf5103ac905a); these fees will be swept into the DAO Treasury with the use of the modernized fee collection infrastructure outlined in the [Nova Fee Router Proposal](https://snapshot.box/#/s:arbitrumfoundation.eth/proposal/0x4ad37b12ffe5c334e0c19113ac54222983e18d36a255fbde60e483592f35fc65). The full balance of ETH–currently 1,885 ETH–will be transferred to the DAO Treasury on Arbitrum One using established smart contract infrastructure.\n\nThere will be an upcoming AIP which combines both the Timeboost AIP and the Nova Fee Sweep action AIP into a single proposal for an on-chain vote on Tally. If the on-chain vote on Tally passes successfully, Timeboost will be enabled on Arbitrum One and Arbitrum Nova and the Nova Fee Sweep action will be executed. This temperature check serves as a way for the DAO to explicitly approve for the fees from the historical [L1TimelockAlias](https://nova.arbiscan.io/address/0xf7951d92b0c345144506576ec13ecf5103ac905a) to the [ChildToParentRouter](https://nova.arbiscan.io/address/0x36d0170d92f66e8949eb276c3ac4fea64f83704d#code).\n\n## Motivation\nHistorically, Nova transaction fees accumulated to the [L1TimelockAlias](https://nova.arbiscan.io/address/0xf7951d92b0c345144506576ec13ecf5103ac905a) address, which required a lengthy constitutional proposal process for the ArbitrumDAO to access or spend. The successful passing of the [Nova Fee Router proposal](https://www.tally.xyz/gov/arbitrum/proposal/108288822474129076868455956066667369439381709547570289793612729242368710728616) redirected these fees to a system of \"fee routers\" that automatically transfers funds to the ArbitrumDAO treasury, reducing quorum requirements, reducing delays, and simplifying accounting by consolidating funds directly in the treasury. As of 28 August 2024, Nova transaction fees began accumulating to a series of RewardDistributor contracts as outlined in the Nova Fee Router proposal, streamlining the revenue collection process for the DAO.\n\nHowever, transaction fees that accumulated to the L1TimelockAlias *before* the Nova Fee Router change went into effect remain in the L1TimelockAlias, totalling 1,885.79 ETH. This proposal intends to sweep these historical Nova transaction fees from the legacy L1TimelockAlias address into the new fee collection system. This will be a one-time task because funds collected after 28 August 2024 have been, and will continue to be, automatically forwarded through the new fee collection system to the ArbitrumDAO treasury.\n\n## Key Terms\n[L1TimelockAlias](https://nova.arbiscan.io/address/0xf7951d92b0c345144506576ec13ecf5103ac905a): address that historically accumulated Nova transaction fees but was replaced by RewardDistributor contracts as a part of the [Nova Fee Router Proposal](https://snapshot.box/#/s:arbitrumfoundation.eth/proposal/0x4ad37b12ffe5c334e0c19113ac54222983e18d36a255fbde60e483592f35fc65) to upgrade the fee collection infrastructure; historical fees held by this address are the subject of this proposal. \n\n[ChildToParentRouter](https://nova.arbiscan.io/address/0x36d0170d92f66e8949eb276c3ac4fea64f83704d#code): smart contract that, when called, creates an L2-to-L1 message which sends the contract’s full ETH balance; once the message is executed, the ETH is transferred to a ParentToChildRouter smart contract on L1\n\n[ParentToChildRouter](https://etherscan.io/address/0x40cd7d713d7ae463f95ce5d342ea6e7f5cf7c999#code): smart contract that, when called, creates a retryable ticket which transfers the contract’s full ETH balance from L1 to the DAO Treasury on Arbitrum One\n\nThe full script for executing the Nova Fee Sweep can be found here: [Standalone Nova Fee Sweep Proposal #303](https://github.com/ArbitrumFoundation/governance/pull/303)\n\n## Steps to Implement\nThe script will be included alongside the onchain AIP which proposes for the adoption of Timeboost on Tally. Since both changes are bundled into one onchain AIP, this temperature check serves as a way for the DAO to explicitly approve for the fees from the historical [L1TimelockAlias](https://nova.arbiscan.io/address/0xf7951d92b0c345144506576ec13ecf5103ac905a) to the [ChildToParentRouter](https://nova.arbiscan.io/address/0x36d0170d92f66e8949eb276c3ac4fea64f83704d#code).\n\nOnce transaction fees are received by the ChildToParentRouter, the automated fee collection process will be activated, forwarding fees to the [ParentToChildRouter](https://etherscan.io/address/0x40cd7d713d7ae463f95ce5d342ea6e7f5cf7c999#code) on L1 and eventually to the [DAO Treasury](https://arbiscan.io/address/0xf3fc178157fb3c87548baa86f9d24ba38e649b58) on Arbitrum One; complete implementation details for this automated fee routing can be found in the [preceding Tally proposal](https://www.tally.xyz/gov/arbitrum/proposal/108288822474129076868455956066667369439381709547570289793612729242368710728616). Please note that Reward Distributor contracts are irrelevant for this particular action as historical fees from the L1TimelockAlias will be transferred directly to the ChildToParentRouter.\n\n## Resources and Timelines:\n[Timeboost + Nova Fee Sweep AIP forum post](https://forum.arbitrum.foundation/t/aip-timeboost-nova-fee-sweep/28247) \nNova Fee Sweep Snapshot: 30 Jan - 6 Feb\n\nThe Arbitrum Foundation will communicate a tentative date for the creation of the onchain AIP in the near future.",
                "discussion": "https://forum.arbitrum.foundation/t/aip-timeboost-nova-fee-sweep/28247",
                "author": "0xb4c064f466931B8d0F637654c916E3F203c46f13",
                "quorum": 0,
                "quorumType": "default",
                "start": 1738297800,
                "end": 1738902600,
                "snapshot": 301065864,
                "choices": [
                    "For",
                    "Against",
                    "Abstain"
                ],
                "labels": [],
                "scores": [
                    168587468.97016487,
                    7425.639520877275,
                    8497.654691809157
                ],
                "scores_total": 168603392.26437742,
                "scores_state": "final",
                "state": "closed",
                "strategies": [
                    {
                        "name": "erc20-votes",
                        "params": {
                            "symbol": "ARB",
                            "address": "0x912CE59144191C1204E64559FE8253a0e49E6548",
                            "decimals": 18
                        },
                        "network": "42161"
                    }
                ],
                "created": 1738298051,
                "updated": null,
                "votes": 3550,
                "privacy": "",
                "plugins": {},
                "flagged": false
            },
            {
                "id": "0x6baef084d47cb0e0f5788449e0d6fafd6312a69f65b550d62d5b6772297b8695",
                "ipfs": "bafkreibyatzb225x6vbh54wdgxvlfohaem3ma6nuf2bfduauxod3hy2qr4",
                "space": {
                    "id": "arbitrumfoundation.eth",
                    "name": "Arbitrum DAO",
                    "avatar": "ipfs://bafkreiejp7kjzjm4mlck45xcfup5lha7wrgqlyghvrtvpjpu5sfb6rl2ei",
                    "network": "42161",
                    "admins": [],
                    "moderators": [
                        "0xd6ca0daa6115bdf4577f26c9fa88f048d15e3ef9"
                    ],
                    "symbol": "ARB",
                    "terms": null
                },
                "type": "basic",
                "title": "Arbitrum Strategic Objective Setting (SOS) – Defining the DAO’s Interim Goals",
                "body": "# Non-Constitutional\n\n# Abstract\n\nFollowing the passing of the [Unifying Arbitrum’s Mission, Vision, Purpose (MVP)](https://v1.snapshot.box/#/arbitrumfoundation.eth/proposal/0xf5fdce242b85134153397754d25a43a49611a3e8a1c73b2e11a67e864c56e022) proposal, we’re moving to the next step in aligning the Arbitrum DAO on its end-state goals and the more granular strategies through which these will be reached. Arbitrum Strategic Objective Setting (SOS) is an initiative through which DAO members will be able to propose and vote on a cohesive set of short- to mid-term objectives in a collective, inclusive, and adaptable way.\n\nThrough the SOS, any contributor can submit a set of short-term (1-year) and mid-term (2-year) objectives and related tangible key results for the DAO. The set of objectives should directly drive the DAO closer to reaching its vision, and align with the mission and purpose, as listed in the MVP proposal. The DAO will then vote on the proposed sets of objectives to select a single collection for implementation.\n\nEvery 12 months, the chosen objective set will be reviewed and, if needed, revised based on changing market conditions, the competitive environment, progress made in the past year, etc. In order to keep the DAO up to date with the progress towards each strategic objective, we suggest the research member of the ARDC be tasked with providing quarterly reports assessing how the DAO has improved through proposals and initiatives as well as suggesting what areas require more attention while recommending solutions to address these areas.\n\nOnce a set of objectives and related key results has been approved, Entropy will strive to build a budgeting framework where each high-level objective is allocated a certain amount of capital on a yearly basis, with interested contributors having the ability to request a share of this capital through a standardized structure. It’s important to note that contributors will still maintain the ability to post standalone proposals outside of this structure and are not forced to tie their initiative to the MVP/SOS/budget framework. Having said that, as the established objectives should be regarded as one of the DAO’s highest priorities, contributors should expect more friction when it comes to passing a proposal that doesn’t reasonably demonstrate that it fits within the established short- to medium-term objectives. In other words, while the freedom to make proposals that fall outside the SOS will not cease to exist, we expect that the DAO will discourage it via the creation of a social contract among delegates.\n\n# Motivation & Rationale\n\nDiversity is undeniably one of Arbitrum DAO’s strengths. We have hundreds of delegates from all around the world with varying perspectives, cultural behaviors, interests, incentives, etc. This is a double-edged sword, however, as it makes it more demanding to converge on unified goals and interim focus areas. The absence of concrete and agreed-upon goals today makes it challenging for the DAO to review progress and facilitate accountability, while it may be unclear to contributors what deliverables they should be prioritizing. Similar to the MVP proposal, the SOS takes inspiration from [Lido](https://research.lido.fi/t/the-guided-open-objective-setting-exercise-goose-proposal-a-genesis-step-to-jump-start-a-dao-wide-goal-setting-exercise-and-cadence/5355)’s approach to materializing short- and medium-term objectives for the DAO.\n\nBy establishing clear short- and mid-term strategic objectives and key results, the outcome of the SOS will serve as a roadmap that will bring cohesion and direction to the DAO’s activities. This structured approach will enable the DAO to move beyond reactive governance and toward proactive strategic development. Having well-defined objectives allows the DAO to measure progress better, identify operational gaps, and adjust course when needed.\n\nThese objectives will create a shared foundation for evaluating opportunities across the DAO’s diverse contributor base. When assessing new initiatives or responding to market developments, delegates and contributors will have tangible criteria to inform their choices. This alignment will help prevent the dilution of efforts that can occur in DAOs, ensuring collective resources and energy are directed towards Arbitrum’s most important goals. A regular review cycle ensures the DAO’s objectives remain responsive to changing conditions while maintaining momentum toward the mission, vision, and purpose. If the MVP helps to define the DAO’s long-term vision, then the SOS allows Arbitrum DAO to chart the course to get there.\n\n# Specifications\n\nThis proposal can be considered to have two distinct phases. The first phase comprises a ~14-day forum review, feedback, and edit period after which the SOS framework will move to the 7-day offchain voting period. If passed, Entropy will consider the structure of the SOS accepted by the DAO, and the second phase will be initiated. In phase two, contributors will submit their strategic objectives matrices with one matrix finally chosen through a Snapshot vote. The periods making up the second phase are described below.\n\n## Notice Period (14 days)\n\nAt the beginning of the 14-day notice period, announcements will be made on the forum and all the other relevant communication channels (e.g., Twitter, Telegram, etc.), giving delegates and contributors enough time to prepare for the upcoming submission period. This announcement will include:\n\n1. The expected start and end dates of all the subsequent periods (submission, feedback, and revision).\n2. Guidelines on how to submit a proposed set of short- and medium-term objectives as well as related key results.\n3. Link to an open channel through which anyone can submit one-off objectives and related key results for consideration by those looking to develop a full-fledged objectives matrix submission.\n4. Link to an FAQ forum thread where delegates can ask questions about the program.\n\nEntropy Advisors will facilitate the end-to-end process in cooperation with the Arbitrum Foundation and any other relevant parties.\n\n## Submission Period (30 days)\n\nThis submission period lasts 30 days, during which delegates and contributors are invited to make their submissions. Those interested in participating will have to create a forum post under a designated Strategic Objective Setting (SOS) subcategory. The goal-setting methodology utilized will be the Objectives and Key Results framework, where each objective (high-level, inspirational goal) is accompanied by key results (specific, measurable outcomes) that once reached, represent an objective having been completed. As a reminder, these objectives should indisputably align with the DAO’s mission, vision, and purpose. At a minimum, a valid submission must include the following information:\n\n1. View of Arbitrum’s current state and what its strengths/weaknesses are\n2. Short-term objectives (1 year)\n3. Mid-term objectives (2 years)\n5. Key results, i.e., measurable success metrics, for all objectives\n6. Risks connected to all objectives\n7. High-level estimates of non-capital resources needed for each objective\n8. Rationale explaining how the objectives align with Arbitrum’s MVP and why they were chosen given Arbitrum’s current state\n\nThe format for a SOS submission post on the forum is as follows (note, while the Title and headers should follow the below format, the information under each header is up to the author; this is a non-exhaustive list):\n\n* Title\n  * Format: [SOS Submission] {Delegate} – Strategic Objectives\n  * Example: [SOS Submission] Entropy Advisors – Strategic Objectives\n* Summary\n  * A brief summary of the strategic objectives\n  * High-level explanation of their impact on Arbitrum.\n  * Main focus areas for each proposed objective (i.e., Stylus, Orbit, Gaming, etc.)\n* Rationale\n  * A general overview of Arbitrum’s current state, including where the author sees the ecosystem’s strengths and weaknesses.\n  * Explanation of how these objectives are aligned with Arbitrum’s MVP, why they were chosen given Arbitrum’s current state, and what risks, required non-capital resources, and expected outcomes are related to the objectives.\n  * Key assumptions and strategic reasoning behind chosen objectives.\n* 1-Year Strategic Objectives & Key Results\n  * A clear and specific statement of each objective.\n  * ~2-5 measurable key results/success metrics per objective.\n\n* 2-Year Strategic Objectives & Key Results\n  * Same format as 1-year strategic objectives.\n* Further Details\n  * Anything else the author feels as though relevant to include in their submission.\n\n### Condensed Example of a 2-Year Strategic Objective (figures are illustrative):\n\nObjective: Arbitrum becomes the indisputable leader within a selection of onchain finance-related verticals: stablecoins, RWAs, and lending.\n\nAlignment with the MVP: As onchain finance-related verticals continue to grow in usage, importance, and impact, it is imperative for Arbitrum to achieve a market-leading position in a certain set of these sectors. Doing so ensures that the ecosystem stays aligned with its vision of being the home for the universal shift onchain, with Arbitrum rollups as the first stop in crypto for users and the default platform for developers.\n\nKey Result 1: Arbitrum One becomes the second largest blockchain in terms of stablecoin volume traded on onchain exchanges.\n\nKey Result 2: RWAs (excluding stablecoins) held within the Arbitrum ecosystem grow by 20x from when the DAO chooses its set of objectives.\n\nKey Result 3: The Arbitrum ecosystem reaches a 30% market share of all outstanding onchain loans.\n\nWhile the number of strategic objectives in a matrix is not limited, proposers should consider the DAO’s capacity to effectively focus on multiple areas simultaneously. Moreover, while the objectives should be aspirational, they must also be attainable. When providing feedback or choosing a specific objective matrix, we encourage delegates to evaluate their feasibility critically. Implementing unrealistic objectives and key results would most likely result in wasted efforts and be counterproductive.\n\nA given year’s objectives are expected to be limited to a specific focus area and not to overlap with each other. As such, we recommend submitters refrain from proposing objectives that are too high level since the potential for overlap increases. Having said that, the sets of 1- and 2-year objectives can be the same as long as key results across years are different.\n\nSee this example from [Hasu’s proposed goals for Lido](https://research.lido.fi/t/hasus-goose-submission-proposed-goals-for-lido-dao-to-consider/5590). When objectives form a cohesive, well-documented strategy, it is more likely to gain support from delegates. Just giving the DAO a list of objectives likely will not be sufficient; the expectation is for the objectives to make up a holistic strategy with a well-reasoned rationale.\n\n## Feedback period (21 days)\n\nOnce the submission period is over, no new objective matrices can be put forward. The submission period is followed by a 21-day feedback period. During this time, submitters are prohibited from making changes to their submissions to allow delegates to examine each submission, provide feedback, and propose edits. This period ensures that all delegates have ample time to familiarize themselves with each submission and that everyone is commenting on the same submission versions.\n\n## Revision Period (14 days)\n\nDuring the revision period, submitters may amend their objective matrices based on community feedback if they wish to do so. Apart from making edits, this period enables submitters to merge their proposals with others, mixing and matching objectives across submissions (note that a given year’s objectives should still have no overlap). If two or more proposals are merged, proposers should post the final version as a new submission in the SOS subcategory and modify the original submissions’ titles to indicate that they have been merged as well as include a link to the merged version at the top of the original submissions. If a proposer feels as though their objectives and key results are already adequately covered by another submission, they are also free to withdraw their submission during the revision period. At the end of the revision period, submissions will be locked and considered as the final versions, which will be the ones put up for a Snapshot vote to choose the DAO’s strategic objectives matrix.\n\n## Voting period (7 days)\n\nFinally, the voting period. Entropy will be in charge of creating a Snapshot vote with a list containing all finalized strategic objective matrices in a single proposal, with delegates voting on which matrix they are the most aligned with and see as optimal. The Snapshot will utilize single-choice voting with an option to abstain. Quorum is reached when at least 3% of all votable tokens have participated in the Snapshot, with the option that has received the most votes being implemented. A strategic objectives matrix proposer is free to vote on their own submission.\n\nFor the avoidance of doubt, delegates will vote on standalone matrices formed by sets of 1- and 2-year objectives and key results. Please note that if there is a vast amount of submissions going to a Snapshot vote, Entropy reserves the right to postpone the initiation of the vote following the revision period to ensure that delegates are given some additional time to examine the final versions of submissions. If there is any confusion in navigating the forum throughout this process, e.g., where to post, how to title posts, how to merge proposals with another author/similar proposal, etc., Entropy Advisors will be available to answer any questions from the community.\n\n## Review Phase & Ad Hoc Strategic Objective Adjustments\n\nAfter the initial strategic objectives matrices are defined and one has been chosen, the DAO is encouraged to review the chosen matrix on a yearly basis. This ensures the objectives and their key results remain relevant and aligned with the DAO’s evolving needs and the overall market dynamics. The process is similar to the second phase described earlier, but delegates can propose to modify existing objectives/key results, add new ones, or remove those that are no longer relevant.\n\nA review phase should be initiated 12 months after the previous voting period has ended. Ideally, OpCo has already been operationalized by then, meaning that the DAO can instruct the entity to manage the review phase. As stated earlier, we propose that the research member of the ARDC is initially tasked with providing quarterly reports assessing how the DAO has progressed with respect to its strategic objectives. Once OpCo is operationalized, this responsibility could also be transferred to the entity if the DAO chooses to do so.\n\nThe review phase is initiated by passing a Snapshot vote. In the proposal, the proposer must define who is in charge of managing the review phase. Given the review phase Snapshot vote passes, there will be a 14-day notice period. This will consist of a forum post updating delegates on the current state of the strategic objectives and informing them on what this review phase consists of. Among other things, this forum post should include:\n\n1. A summary of the strategic objectives and how successful the DAO has been with respect to fulfilling them.\n2. The expected start and end dates of all the subsequent periods.\n3. Guidelines on how to submit an amendment.\n4. Link to a FAQ forum thread where delegates can submit questions about the program.\n\nAfter the notice period, delegates are invited to submit amendments to the initially chosen strategic objectives matrix during a 30-day submission period. Amendments are not limited to simply modifying strategic objectives and key results. They can also involve removing, adding, or replacing specific objectives and associated key results.\n\nOnce the submission period ends, amendment submissions go through a 21-day feedback period during which no changes can be made to the submissions. Finally, a 14-day revision period will take place during which proposers can make edits to their proposed matrices and merge them with other proposed matrices before being locked and put up for a Snapshot vote to choose the new objective matrix. If no amendment submissions are made, there is no need to move to the feedback, revision, or voting periods, and the old objectives matrix will remain effective.\n\nNote that the review phase timeline given above can be modified at the discretion of the review phase proposer depending on the number of submissions made.\n\nAs mentioned earlier, the SOS review phase should be conducted annually, with each cycle beginning 12 months after the conclusion of the previous voting period. However, if there's a pressing need to review the strategic objectives due to, e.g., changes in the market environment, competitive space, or the DAO’s financials, a delegate can create a forum post outlining extensive reasoning for ad hoc adjustments accompanied by the proposed strategic objectives and related key results. Allowing for at least one week for discussion, the forum post will then be put up for a Snapshot vote utilizing single-choice voting with the options of adopting the proposed objectives and key results, initiating a fast-tracked review phase with a similar structure as described above (again, the proposer has to define who is managing this phase), and leaving the current objectives and key results unchanged.\n\nIt’s important to note that a well-structured strategy objectives matrix **should not be expected to be changed frequently**. As such, a proposed ad hoc adjustment must be extremely rigorously argumented and only take place if most of the previous strategic objectives have been reached or given unprecedented/emergency circumstances. Moreover, delegates ought to be highly critical when such adjustments are proposed. For example, the proposer simply stating that they disagree with the current objectives should not be a strong enough reason to modify the objectives.\n\nIf an objectives matrix is changed on an ad hoc basis, the originally scheduled review phase will be pushed back. This phase should only be initiated once 12 months have elapsed since the previous vote to change the DAO’s strategic objectives and related key results has passed.\n\nAdditionally, the DAO’s strategic objectives and related key results can be removed by creating a forum post explaining the reasoning to do so. Allowing for at least one week for discussion, the post will be moved to a single-choice Snapshot vote with the voting options “For”, “Against”, and “Abstain”, requiring a simple majority with at least 3% of all votable tokens voting either “For” or “Abstain” for the proposal to pass.\n\nPreviously chosen, not yet achieved objectives and related key results will remain active during a Review/Ad Hoc Strategic Objective Adjustments Phase to ensure the continuity of the DAO's strategic direction, replaced only once a new objectives matrix has been selected through a dedicated voting process. I.e., unless the DAO votes to remove its objectives, the continuity of the SOS is ensured.\n\n# Timeline\n\n* First Phase (Ratification of the SOS Framework):\n  * Review, Feedback, & Edit Period: January 10th - January 23rd\n  * Snapshot Period: January 23rd - January 30th\n* Second Phase (Ratification of a Strategic Objectives Matrix):\n  * Notice Period: 14 days (note that this period's initiation might be pushed back slightly such that submitters will have more time to include possible takeaways from ETHDenver into their matrices during the Submission Period) \n  * Submission Period: 30 days\n  * Feedback Period: 21 days\n  * Revision Period: 14 days\n  * Voting Period: 7 days\n* Review Phase (Potential Amendments to the Strategic Objectives Matrix): Initiated 12 months after the previous voting period has ended or as a result of an ad hoc adjustments proposal as described above.\n\n*Note that any of the time periods in the first and second phases can be shortened/extended at Entropy’s discretion depending on the number of submissions received.*",
                "discussion": "https://forum.arbitrum.foundation/t/arbitrum-strategic-objective-setting-sos-defining-the-dao-s-interim-goals/28102",
                "author": "0xb4c064f466931B8d0F637654c916E3F203c46f13",
                "quorum": 0,
                "quorumType": "default",
                "start": 1737677189,
                "end": 1738281989,
                "snapshot": 298602250,
                "choices": [
                    "For",
                    "Against",
                    "Abstain"
                ],
                "labels": [],
                "scores": [
                    137793892.4581608,
                    50394.722899135115,
                    3896.3564330744
                ],
                "scores_total": 137848183.53749302,
                "scores_state": "final",
                "state": "closed",
                "strategies": [
                    {
                        "name": "erc20-votes",
                        "params": {
                            "symbol": "ARB",
                            "address": "0x912CE59144191C1204E64559FE8253a0e49E6548",
                            "decimals": 18
                        },
                        "network": "42161"
                    }
                ],
                "created": 1737677189,
                "updated": null,
                "votes": 3559,
                "privacy": "",
                "plugins": {},
                "flagged": false
            },
            {
                "id": "0x959fb55d9887a68d3df6647e55010692777cc40e5c9b131dfdb3eedb8970dc6a",
                "ipfs": "bafkreig43vpohpk7mdpgsytshes5x5k35jdnurg7eegnnhiaacp3zg4dum",
                "space": {
                    "id": "arbitrumfoundation.eth",
                    "name": "Arbitrum DAO",
                    "avatar": "ipfs://bafkreiejp7kjzjm4mlck45xcfup5lha7wrgqlyghvrtvpjpu5sfb6rl2ei",
                    "network": "42161",
                    "admins": [],
                    "moderators": [
                        "0xd6ca0daa6115bdf4577f26c9fa88f048d15e3ef9"
                    ],
                    "symbol": "ARB",
                    "terms": null
                },
                "type": "single-choice",
                "title": "Proposal for Piloting Enhancements and Strengthening the Sustainability of ArbitrumHub in the Year Ahead",
                "body": "**Note:** This proposal is a revised version of our initial draft shared for discussion on November 30th. In reality, it represents the 3rd proposal after incorporating valuable feedback from community members and key delegates. Below are the links attached for previous proposals.\n\n**1st Proposal (June 2024):** [Proposal Link](https://forum.arbitrum.foundation/t/non-constitutional-arbitrumhub-evolution-the-next-step-in-streamlining-information-access-and-raising-awareness-for-arbitrum-dao/24857)  \n- **Outcome:** Failed in Snapshot voting  \n- **Community Feedback:** Lacked clear KPIs and a detailed budget breakdown.\n\n**2nd Proposal (November 2024, RFC):** [Proposal Link](https://forum.arbitrum.foundation/t/non-constitutional-proposal-for-maintenance-and-continuous-enhancement-of-arbitrumhub-to-meet-the-evolving-needs-of-the-arbitrum-ecosystem-and-dao/27667)  \n- **Community Feedback:** Its scope and deliverables were deemed too broad. The feedback emphasized the need to narrow the focus, streamline the deliverables, and \n    reduce the budget. Emphasis was placed on prioritizing content quality and platform maintenance.\n\nWe believe the feedback have played a crucial role in refining our approach and finding the key strategic way for establishing ArbitrumHub as a robust Platform.\n\n### Key Resources:\n- **ArbitrumHub Platform:** [Visit Platform](https://www.arbitrumhub.io/)\n- **ArbitrumHub Research Document:** [View Document](https://drive.google.com/file/d/1XrYF2L30tS4paZs1xwVBagd2BXcH66A2/view) (*Note:* This file is large and may take some time to load. We appreciate your patience.)\n- **GitHub Open-Source Code:** [Access Code](https://github.com/HoomanDigital/ArbitrumDAO_Hub)\n- **Looker Studio Link (for Tracking Platform Analytics):** [View Analytics](https://lookerstudio.google.com/u/0/reporting/f0081ef4-8322-4ba7-b685-afcc38547bb8/page/u9hPE)\n\n## Things to Consider While Analyzing the Platform:\nPlease note that some information on the platform may not always be entirely accurate or up-to-date, primarily due to resource constraints. From the past year, we have independently built, managed and maintained the platform using the resources at our disposal. Despite these limitations, we strive to provide the most accurate and updated information, deploying any additional resources to improve its quality.  \nWe encourage you to view this platform as a **proof of concept** for what we aim to achieve. Imagine the possibilities we could unlock with dedicated support and resources from the DAO. The DAO support would enable us to significantly enhance this platform and fully realize its potential.\n\n## DAO Feedback Addressed\nBased on feedback from the DAO, we are considering carrying ArbitrumHub as a pilot for the first year with a limited scope. The core focus will be on addressing content needs and refining the platform based on community feedback, DAO needs while utilizing minimal resources.\n\n### Key Changes:\n- **Core Focus on Platform Maintenance:** Prioritizing ongoing platform maintenance and updates over expansion.\n- **Reduced Fragmentation:** We are adopting a focused approach to streamline efforts and consolidate resources, ensuring a strong foundation for ArbitrumHub.\n- **Minimal Resources:** Operating with a minimal resource allocation to ensure efficient use of funds and focus on core needs.\n\n### MSS Setup for Fund Request:\n- **Quarterly Fund Withdrawals:** Funds will be withdrawn on a quarterly basis from the MSS.\n- **Initiative Termination Clause:** The initiative may be stopped if the DAO reaches a consensus that the proposed value is not being delivered at any point.\n\n## Comparison Between Foundation site and ArbitrumHub:\nThe Foundation is one of the bodies of the Arbitrum DAO, focused primarily on providing specific information aimed at builders. Their goal is to make the Arbitrum blockchain more efficient. The Foundation's target audience includes developers and builders, with an emphasis on onboarding them to the Arbitrum ecosystem.\n\nIn contrast, ArbitrumHub provides a comprehensive overview of all Arbitrum DAO initiatives, including governance and various ecosystem activities. Our target audience includes individuals involved in governance, Web3 service organizations, strategists, and community members from arbitrum and other DAOs, as well as anyone interested in understanding what Arbitrum has to offer.\n\nAdditionally, ArbitrumHub serves as a platform to showcase community initiatives on a single platform, ensuring better visibility and reach. For instance, the Community Hub serves as a space to highlight community-driven contributions—something that is currently lacking within the Arbitrum ecosystem. ArbitrumHub is fulfilling this need by providing a dedicated space for these initiatives and enhancing the accessibility to everyone.\n\nWhile we acknowledge that the Foundation's website is effective in its purpose, we recognize that the Foundation has a distinct goal and target audience. The Foundation’s internal focus is on improving the Arbitrum blockchain for builders, while their external focus revolves around onboarding builders to the Arbitrum blockchain and presenting relevant information accordingly.\n\n### Foundation Focus:\n- **Internal Focus:** Enhancing the Arbitrum blockchain for builders.\n- **External Focus:** Onboarding builders to the Arbitrum blockchain, with information presented in a way that caters specifically to their needs.\n\n![258d08ba92894870e422a8833fd31aa2d8e6780c_2_592x300[1].jpeg](ipfs://bafybeiav5jw2ddwbev2hgav6tbqpbpavjeqoqzcrx22e6p3zg5b6ybbvx4)\n**Note:** The image above represents the bi-annual progress report, highlighting the scope and target audience of the Arbitrum Foundation. It illustrates how ArbitrumHub complements the Foundation's efforts rather than duplicating them. In fact, ArbitrumHub has previously been utilized by the Foundation to showcase various grant programs and accepted projects. ArbitrumHub aims to serve as a comprehensive, one-stop solution for all things arbitrum. The ArbitrumHub team is committed to collaborating with the Foundation and the leaders of various community initiatives to ensure its relevance across all verticals within the Arbitrum ecosystem.\n**Source:** [Arbitrum Foundation Bi-Annual Progress Update H1 2024](https://forum.arbitrum.foundation/t/the-arbitrum-foundation-bi-annual-progress-update-h1-2024/26538)\n\n## ArbitrumHub Focus:\n- **Internal Focus:** Providing a comprehensive overview of all Arbitrum DAO initiatives, governance, and ecosystem activities, with a strong emphasis on platform maintenance and refinement based on community feedback.\n- **External Focus:** Engaging a broad audience, including governance participants, Web3 organizations, strategists, and community members from other DAOs, by offering insights into what the Arbitrum ecosystem has to offer. Additionally, ArbitrumHub serves as a platform for showcasing community-driven projects and initiatives to enhance visibility and foster collaboration.\n\nPlease check out the [Community Hub](https://www.arbitrumhub.io/community-hub/contributions/guides/) | [Programs Section](https://www.arbitrumhub.io/programs/entropy-advisors).\n\n![7a89e619b21bec15fdb5c061c34129c0af3f9648_2_936x571[1].jpeg](ipfs://bafybeihsexxbiwcoernibrjz6zf5b2wwqhzy4ghvv6k6fzixhcfcxfbgy4)\n\n\n\n# 1. Abstract\n\nThe ArbitrumHub project emerged from over a year of active involvement in the Arbitrum ecosystem, during which we identified a critical need for a unified platform for ArbitrumDAO. Through extensive community engagement, research, and participation in DAO meetings, it became evident that new members, centralized organizations, participants from other DAOs, and young enthusiasts lacked a single point of reference for all developments and initiatives within the ecosystem. To address this gap, we began laying the foundation of ArbitrumHub 1+ year ago. With dedicated research, collaboration with key stakeholders, and a project team committed to design, development, and iteration, ArbitrumHub has evolved into a comprehensive resource at [arbitrumhub.io](https://www.arbitrumhub.io).\n\n![9639757fe0e675e465f7d87a94665d1d575179b0_2_790x750[1].jpeg](ipfs://bafybeibsiuffn6v3v6t7ylxctfduy3ueoxe3ptp6bs3wg7eozdedt5c5b4)\n\n# 2. Motivation\n\nArbitrumHub was created to address the critical need for a centralized resource hub within the ArbitrumDAO community. As the ecosystem expands, it becomes increasingly challenging to stay informed and connected. ArbitrumHub simplifies this process by offering a single, reliable source of essential information, structured in a way that is both accessible and comprehensive. \nArbitrumHub aspires to become the community’s go-to destination for vital insights into ArbitrumDAO and its ongoing initiatives. By maintaining a unified platform, we ensure community members and external participants have access to updates, meeting details, and opportunities to engage with the ecosystem. This approach not only strengthens community involvement but also fosters a more informed and engaged Arbitrum ecosystem.\n\n![44b5eceefda5f291ee82b2e86e425ba132f416dd_2_936x630[1].png](ipfs://bafybeieazvqjqvatfzetoiodvu25slxhhgsat7xazfw552jecmbmzl3y6a)\n\n\n# 3. Rationale for DAO Approval\n\nArbitrumHub serves as the essential first point of contact for existing and new users in the Arbitrum ecosystem, consolidating scattered information and providing a continuously updated resource. Given the importance of this platform in fostering ecosystem cohesion and accessibility, we are seeking DAO approval to formalize ArbitrumHub’s role within the ArbitrumDAO structure.\n\nSecuring DAO support would allow us to designate ArbitrumHub as a DAO-backed platform, which we can publicly display in the About section on ArbitrumHub.io, reinforcing its credibility and trust within the ecosystem. Formal approval would also enable a closer working relationship with DAO program managers and delegates, establishing an ongoing feedback loop and creating a foundation for designing and implementing effective Standard Operating Procedures (SOPs) with key stakeholders. This formalized connection ensures that ArbitrumHub remains aligned with the DAO’s strategic objectives, enhancing the platform’s long-term impact and value to the Arbitrum ecosystem.\n\n![43e45b56a1b48ce31882a32c80856120148c22c8_2_936x724[1].png](ipfs://bafybeicsou6sovh3a6gsnqto3m7speh5nfvshxp6kg5qqfemwaqi7zbkcu)\n\n\n# 4. Key Uses of ArbitrumHub\n\nArbitrumHub is a centralized and open-source platform designed to streamline user access to essential resources, real-time updates, and community engagement within the Arbitrum ecosystem. It addresses the need for a unified, easily navigable platform for new and existing users. Key functionalities include:\n\n### a. Real-Time Updates\nIntegrates the latest news and developments within the Arbitrum ecosystem, ensuring users have timely access to important updates.\n\n### b. Community Interaction and Events\nKeeps the community informed about upcoming meetups, workshops, and events, promoting active participation and engagement.\n\n### c. Centralized Support and Resources\nProvides dedicated support for platform-related queries and aggregates essential resources, such as developer tools and grant information, in one location.\n\n### d. Enhanced Visibility and Engagement\nLeverages social media and newsletters to increase visibility and user engagement, keeping the community informed and involved.\n\n### e. Community Participation\nEncourages active participation by offering educational resources, events, and opportunities for contribution, fostering ongoing community involvement.\n\n### f. Ambassador Program Highlights\nActs as a central directory for ambassador activities, allowing easy management and access to ambassador-related initiatives.\n\n![908bacbe6a3b97dd56ee29f44ad69c4ce2614ffe_2_936x325[1].png](ipfs://bafkreift3urcoddbscul7qcxgufx2om2scpmyoczk2yilir6f72x3arygy)\n\nArbitrumHub fills a crucial gap within the ArbitrumDAO by providing a centralized, up-to-date platform that simplifies onboarding and keeps users engaged. Initially, our team faced difficulties in accessing the necessary information to fully participate in the ecosystem, a challenge that many users encounter. ArbitrumHub eliminates these barriers, offering a seamless experience that will help attract and retain new members while fostering the continued growth of the ArbitrumDAO.\n\n\n\n# 5. KPI and SOP Implementation\n\nWe have conducted extensive research to establish refined Key Performance Indicators (KPIs) and Standard Operating Procedures (SOPs) to ensure that ArbitrumHub operates at peak efficiency while fostering community engagement. Based on feedback received from our initial draft shared on November 30th, we have streamlined  resources towards platform maintenance, and effectively reduced the overall budget. This approach not only enhances the platform’s operational efficiency but also ensures that community needs are continuously addressed and prioritized.\n\n# Key Performance Indicators (KPIs)\n\n\n## Core Focus  \nOur primary focus will be the maintenance and optimization of the platform, ensuring it serves the needs of the defined target audience. To achieve this, we will focus on the following initiatives:\n\n\n### 1. Content Updates and Enhancements  \n- **Objective:**  \nEnsure regular and timely content updates to keep the Arbitrum Hub informative, relevant, and aligned with community needs. Focus on maintaining consistency and delivering planned enhancements as outlined in the roadmap.  \n\n- **Deliverable:**  \nPublish weekly content updates and provide a quarterly progress report summarizing updates and enhancements implemented.  \n\n---\n\n### 2. Bi-Weekly Newsletter Delivery  \n- **Objective:** Keep the registered community informed about platform developments and opportunities through regular updates.  \n- **Deliverable:** Deliver **26 newsletters per year**, providing valuable insights and announcements.  \n\n---\n\n### 3. Social Media Updates\n- **Objective:** Foster community engagement and enhance platform visibility through consistent management of a Arbitrumhub's dedicated 'X' account and collaboration with different program initiatives.\n- **Deliverable:** Publish **5 original posts per week**, maintaining audience engagement while ensuring content quality and relevance.  \n\n---\n\n### 4. Quarterly Platform Audit Report  \n- **Objective:** Conduct comprehensive audits of platform updates, including code modifications, content accuracy, design changes, sitemap adjustments, and other enhancements.  \n- **Deliverable:** Submit **four quarterly audit reports** to the DAO, providing a detailed assessment of platform performance and updates.  \n\n---\n\n### 5. Open-Source GitHub Code  \n- **Objective:** Enhance community collaboration and ensure transparency by making the platform’s development work accessible.  \n- **Deliverable:** Maintain a well-documented, up-to-date GitHub repository that reflects all platform updates and development activities.  \n\n---\n\n### 6. User Analytics Dashboard  \n- **Objective:** Monitor user activity and behavior using a dedicated analytics dashboard to gather actionable insights.  \n- **Tool:** Utilize **Looker Studio** to host the **Arbitrum Hub Analytics Dashboard** for real-time user analytics.  \n\n---\n\n### 7. User Engagement and Platform Utility  \n- **Objective:**  \nOne of the key winning factors is to measure platform usage and utility through user activity trends and monthly survey reports, which will help assess satisfaction and identify areas for improvement..  \n\n- **Deliverable:**  \nSubmit quarterly user engagement reports, including metrics such as active users, session durations, and survey feedback analysis, with recommendations for enhancements.\n\n---\n\n### 8. Platform Enhancements  \n- **Objective:** Continuously improve user experience by integrating new sections and initiatives based on research findings or specific requests.  \n- **Process:** Follow **SOP(b)** for a standardized approach to assessing and implementing updates.  \n\n---\n\n### 9. Content and Meeting Archive Management  \n- **Objective:** Maintain a central comprehensive repository of all meeting information, including recordings and critical strategic reports, such as the Monthly Token Flow Report.  \n- **Inclusion:** Document and incorporate these records as part of the **Quarterly Platform Audit Report**, ensuring transparency and easy accessibility for stakeholders.  \n\n---  \n![67e595ccc0783f1241a2b948d2e0b8fa8e3a346e_2_1035x547[1].png](ipfs://bafkreifk3g4m4gyturcp2rlt2ijuduakffizxcgzrmhp43vji5zepgeg3e)\n\n\nThese KPIs aim to ensure the platform's effective maintenance, continuous improvement, and community engagement while meeting the expectations of the DAO.\n\n# Standard Operating Procedures (SOPs)\n\nThe SOPs ensure consistent platform updates, efficient enhancements, and data-driven improvements to maintain accuracy, relevance, and user engagement.\n\n---\n\n## SOP(a): Quarterly Program Review Check-ins  \n**Deliverables:** 4 Quarterly Check-ins from each DAO Initiative\n\n### Objective  \nTo ensure the accuracy and relevance of information on program-specific pages through quarterly content reviews with designated program managers.  \n\n### Procedure  \n1. **Quarterly Review Initiation**  \n   Send a formal request to the designated program manager(s) each quarter using approved communication channels.  \n2. **Content Verification**  \n   Confirm all information is up-to-date, accurate, and aligned with current program objectives.  \n3. **Follow-up and Confirmation**  \n   If there is no response within 5 business days, send a reminder. Log the interaction and resulting actions.  \n\n### Reporting  \nSummarize outcomes in the quarterly Platform Audit Report, detailing updates implemented or outstanding verification tasks.  \n\n---\n\n## SOP(b): Platform Enhancements Based on Research/Requests  \n**Deliverables:** As Required, Based on Research/Requests  \n\n### Objective  \nTo systematically manage and implement new sections and initiatives based on internal research findings or community requests.  \n\n### Procedure  \n1. **Request & Research Gathering**  \n   Collect enhancement requests and categorize by priority, impact, and feasibility.  \n2. **Initial Assessment and Feasibility Analysis**  \n   Assess technical requirements, resource availability, and alignment with platform objectives.  \n3. **Approval Process**  \n   Present prioritized enhancements to stakeholders for approval.  \n4. **Implementation and Integration**  \n   Work with relevant teams to implement approved changes.  \n\n### Documentation and Reporting  \nDocument each enhancement and include a summary in the Quarterly Platform Audit Report.  \n\n---\n\n## SOP(c): Quarterly Platform Analytics Reporting and Iteration  \n**Deliverables:** 4 Quarterly Platform Analytics Reports  \n\n### Objective  \nTo generate insights into platform user behavior and interactions, enabling data-driven iterations to enhance user experience and engagement.  \n\n### Procedure  \n1. **Data Collection and Dashboard Monitoring**  \n   Continuously collect data on user interactions via the Analytics Dashboard.  \n2. **Quarterly Analysis**  \n   Conduct detailed analysis, identifying trends and friction points.  \n3. **Report Preparation**  \n   Prepare formal reports summarizing findings and recommendations for improvements.  \n\n### Action Plan and Implementation  \n1. **Action Plan Development**  \n   Develop an action plan based on findings with specific changes.  \n2. **Stakeholder Review and Approval**  \n   Present the action plan for feedback and approval.  \n3. **Implementation**  \n   Implement approved changes, ensuring alignment with platform objectives.  \n4. **Documentation and Follow-Up**  \n   Document all changes and include a summary of actions and progress in the Quarterly Analytics Report.\n\n![bae77fc54144ee64f85a708f2105f50490228e7d_2_936x498[1].png](ipfs://bafkreicjxfjioru3zqmab3xjc6w3dndh7gfhhkhmtr2jbohnxem3ymdmim)\n\n# Wisdom Behind Every Design Element  \n\nEvery design element on the platform has been meticulously crafted to serve both functional and strategic objectives. These thoughtful choices ensure a seamless user experience while advancing the platform’s overarching mission.  \n\n### Inclusion of Links to Forum, Snapshot, and Tally for Approved Programs  \nThis design feature, though seemingly minor, is fundamental to fostering user engagement and promoting education. It addresses several critical objectives:  \n\n#### a. Streamlined navigation Experience  \n- **Objective:** Enable users to engage directly with the main source of information, bridging the gap between theory and practice.  \n- **Impact:** By navigating main sources of every information—discussion, voting, and implementation—users gain an immersive understanding of governance processes.  \n\n#### b. Enhanced Learning and Accessibility  \n- **Objective:** Provide an interactive learning experience, empowering users to comprehend the mechanics of DAO operations intuitively.  \n- **Target Audience:** This feature is particularly valuable for users new to decentralized systems, enabling their transition from passive observers to active participants.  \n- **Outcome:** Simplifying complex functionalities lowers entry barriers, fostering broader community involvement.  \n\n#### c. Attracting Larger Organizations and Firms  \n- **Objective:** Demystify DAO governance processes for organizations, studios, and firms that possess the resources and expertise to make significant contributions.  \n- **Strategy:** Present the proposal lifecycle transparently to serve as an onboarding tool for these stakeholders.  \n- **Impact:** Builds trust and encourages participation from high-value contributors, enriching the DAO ecosystem.  \n\n---\n\n### Strategic Benefits of This Design Choice  \nBy integrating these source-of-information into the platform:  \n1. **Transparency is Enhanced:** Users can observe and participate in decision-making processes, reinforcing trust in the DAO’s operations.  \n2. **Participation is Encouraged:** Simplifying governance mechanisms empowers users to engage confidently and meaningfully.  \n3. **Broader Appeal:** The design attracts a diverse audience, including novice users and resource-rich organizations, thereby expanding the DAO’s influence and reach.  \n\n### Expert Perspective  \nFrom a user experience standpoint, this approach exemplifies design excellence by harmonizing education, accessibility, and functionality. Emphasizing interaction transforms users into active contributors, creating a virtuous cycle of engagement and value creation. This ensures the platform remains a dynamic and inclusive ecosystem, poised to support the DAO’s long-term success.  \n\n---\n\nFor more insights and examples, please explore the platform.\n\n# Comprehensive Cost Breakdown for ArbitrumHub Initiative  \n\nOur approach for the upcoming year centers solely on **platform maintenance** and satisfying the **defined target audiences**, ensuring that all efforts are concentrated on these core objectives. By avoiding a fragmented approach and streamlining operations, we've significantly reduced the budget required to carry out the platform's operations. This strategic focus allows us to maximize efficiency and ensure that every resource is directly aligned with platform stability and user engagement.\n\nThis clear, purpose-driven approach to resource allocation and budget management allows us to deliver consistent and impactful results while maintaining a sustainable operational cost structure for the year.\n\n### Here's a clearer breakdown of the Arbitrumhub's team roles, responsibilities and their associated costs, including the total cost for the entire year:\n\n| **Role**             | **Price (Hourly)** | **Daily Average Hours** | **Weekly Hours (5 working days)** | **Monthly Hours** | **Monthly Price** | **Description**                                                                                                                                 |\n|----------------------|--------------------|--------------------------|-----------------------------------|-------------------|-------------------|-------------------------------------------------------------------------------------------------------------------------------------------------|\n| Research             | $50                | 4                        | 20                                | 80                | $4,000            | Responsible for exploring the Arbitrum ecosystem, monitoring user engagement via Looker Studio Analytics, staying updated on developments within various DAO initiatives and the broader Arbitrum ecosystem, and creating detailed reports to be provided for copywriting.        |\n| Copywriting           | $60                | 6                        | 30                                | 120               | $7,200            | Analyzing content, creating headlines, descriptions, and presenting well-formatted web content, social media posts content and newsletter's.                            |\n| Design (part-time and minimal)       | $60                | 2                        | 10                                | 40                | $2,400            | Designing web components, infographics, and custom elements, creating new pages or enhancing existing ones for DAO initiatives, and producing graphics for social media and blog posts.    |\n| Development (part-time and minimal)           | $60                | 2                        | 10                                | 40                | $2,400            | Managing open-source code on GitHub, implementing new features as per needs, updating platform content, troubleshooting errors, and actively engaging with the community.   |\n| PM & Communication       | $80                | 2                      | 10                               | 40                | $3,200            | Managing daily platform operations, communication with a focus on optimizing team efforts and ensuring smooth progress.                                          |\n\n### **Total Monthly**: $19,200\n\n---\n\n### Yearly Breakdown:\n- **Total Monthly Price**: $19,200\n- **Quaterly Price**: $57,600\n- **Total Yearly Price**: $230,400\n\n**At the time of the proposal, the requested amount will be fully converted to $ARB, with the budget and quarterly withdrawals specified in $ARB tokens.**\n\nAny additional costs, such as hosting or tools, will be covered by the ArbitrumHub's team during this pilot year. We are committed to the platform's growth and its relevance in the Arbitrum ecosystem.\n\n### Notes:\n- This breakdown includes the minimal industry per-hour cost for expert talent, optimized to reduce the hourly commitment of each role while focusing on platform maintenance.\n- The resource allocation and hours have been adjusted based on DAO feedback to ensure efficiency, execution quality, and an appropriate balance of responsibilities for each role.\n- The budget has also been reduced significantly considering the first year being arbitrumhub's pilot to build the strong ground on its relevance and usecases.\n\n## Retroactive Funding \nWe would like to highlight that we have been diligently working on and building this platform over the past year at our own discretion with early starter-grant support from pL labs back in jan-feb 2024. Given the effort and commitment invested for past months at our own discretion, we believe it is reasonable to seek retroactive compensation for the work completed thus far.\n\nWe respectfully request a **minimum of $40k USD** as retroactive funding for over **10+ months of dedicated work**. This request is entirely optional and subject to the discretion of the DAO.\n\nShould the DAO recognize and appreciate our contributions, we would be sincerely grateful. However, if the DAO decides otherwise, we fully understand and respect the decision, acknowledging the dynamics and priorities of the DAO landscape.\n\n\n## Feedback Mechanism and Success Metrics\n\n### Feedback Mechanism\nTo foster continuous improvement and maintain alignment with community/DAO expectations, we have implemented a structured feedback mechanism integrated into our operational processes. This mechanism ensures that insights from users, stakeholders, and the broader community are systematically collected, evaluated, and acted upon.\n\n1. **Community Engagement & Open Collaboration**\n   - **Open Source Accessibility**: open-source GitHub code is public for community contributions.\n   - **Social Media Outreach**: Active Twitter engagement (5 posts/week) to gather feedback.\n   - **Usecases**: One of the key winning factors is to measure platform usage and utility through user activity trends and monthly survey reports, which will help assess satisfaction and identify areas for improvement…\n\n3. **Quarterly Check-ins & Feedback Loops**\n   - **Quarterly Program Reviews**: Program-specific content and feedback are reviewed quarterly. (SOP(a)).\n  \n4. **Platform Analytics & User Behavior Insights**\n   - **User Analytics Dashboard**: Real-time user engagement insights on Looker Studio.\n   - **Quarterly Analytics Reports**: Trends and action plans for improvement (SOP(c)).\n\n5. **Enhancements Based on Requests** \n   - **Requests Evaluation**: Community/DAO requests are prioritized and implemented after review (SOP(b)).\n\n### Success Metrics\nThe success of ArbitrumHub is evaluated using clearly defined metrics that align with the platform’s objectives. These metrics are linked to the KPIs and operational SOPs, ensuring measurable outcomes and accountability.\n\n**Performance Indicators**\n1. **Content Accuracy & Timeliness**: Core focus on platform maintenance and content prevents fragmentation, ensuring that the information is both current and relevant.\n2. **User Engagement & Retention**: Tracked via User Analytics Dashboard, with quarterly reports (SOP(c)).\n3. **Platform Growth & Enhancement**: Measured by new initiatives based on research/community requests (SOP(b)).\n4. **Community Involvement**: Increased contributions on GitHub.\n6. **Communication & Outreach**: 26 newsletters annually; active social media presence (5 posts/week).\n\nThese mechanisms ensure ArbitrumHub operates effectively, adapts to user needs, and fosters a transparent, collaborative environment.\n\n![4e0d0cfe686e3c72e9f72869b101839ecdaa6602_2_936x504[1].png](ipfs://bafybeidcy7va4kcwmay7uchl3uy5fnz5hdryx5embo5hlimdjb5tqpocwu)\n\n## Key Revisions Based on Feedback:\n\n- **Focus on Platform Maintenance and information accuracy**:  \n  Dedicated efforts on platform upkeep for the entire year, avoiding fragmentation.\n\n- **Reduced Fragmentation**: Prioritized a focused approach to consolidate resources and streamline efforts, ensuring a solid foundation for ArbitrumHub.\n\n- **Revised Role Hours**:  \n  Streamlined hours per role, focusing on platform maintenance based on DAO feedback.\n\n- **Revised Budget**:  \n  Optimized budget with clear justification for every expenditure.\n\n- **Defined Target Audiences**:  \n  Focused efforts on meeting the needs of clearly identified target audiences.\n\n\n ## Commitment to Excellence\n\nThis proposal reflects our dedication to creating a platform that prioritizes transparency, community engagement, and measurable success. By addressing past challenges and proactively improving key aspects, we are confident that this revised approach will meet the expectations of stakeholders and deliver meaningful value to the Arbitrum ecosystem.\n\nWe look forward to the support of DAO & community in taking this forward.\n\n ## Voting Option & Governance timeline\n1. **For with retroactive**\n2. **For without retroactive**\n3. **Abstain**\n4. **Against**\n\nThank you.\n\n![b66f10c30c406b2c7e78277483c92595d54cbb9a_2_936x535[1].jpeg](ipfs://bafybeiawhmzctqd4e4eerabcchbjh2azfsvvs3naqrq55izdqmgfpbqkam)",
                "discussion": "https://forum.arbitrum.foundation/t/non-constitutional-proposal-for-piloting-enhancements-and-strengthening-the-sustainability-of-arbitrumhub-in-the-year-ahead/",
                "author": "0xd333Bc5c9670C9cEb18f9A2CF02C6E86807a8227",
                "quorum": 0,
                "quorumType": "default",
                "start": 1737648000,
                "end": 1738252800,
                "snapshot": 298396849,
                "choices": [
                    "For with retroactive",
                    "For without retroactive",
                    "Abstain",
                    "Against"
                ],
                "labels": [],
                "scores": [
                    4738624.124694626,
                    6944707.431125336,
                    12550762.530926157,
                    98427751.28586242
                ],
                "scores_total": 122754203.82269344,
                "scores_state": "final",
                "state": "closed",
                "strategies": [
                    {
                        "name": "erc20-votes",
                        "params": {
                            "symbol": "ARB",
                            "address": "0x912CE59144191C1204E64559FE8253a0e49E6548",
                            "decimals": 18
                        },
                        "network": "42161"
                    }
                ],
                "created": 1737626268,
                "updated": null,
                "votes": 3270,
                "privacy": "shutter",
                "plugins": {},
                "flagged": false
            },
            {
                "id": "0x2bc8e69eb65f3b2127072242ca317f51578db014019e22e8b370254e0566a4cf",
                "ipfs": "bafkreicv6agmtk7gyi5ewdsfhia2czefkg2afxinmuei2qrqt7jw6ymiqi",
                "space": {
                    "id": "arbitrumfoundation.eth",
                    "name": "Arbitrum DAO",
                    "avatar": "ipfs://bafkreiejp7kjzjm4mlck45xcfup5lha7wrgqlyghvrtvpjpu5sfb6rl2ei",
                    "network": "42161",
                    "admins": [],
                    "moderators": [
                        "0xd6ca0daa6115bdf4577f26c9fa88f048d15e3ef9"
                    ],
                    "symbol": "ARB",
                    "terms": null
                },
                "type": "basic",
                "title": "The Watchdog: Arbitrum DAO's Grant Misuse Bounty Program",
                "body": "## Abstract\n\nThe Arbitrum DAO has allocated over 422m ARB tokens across various initiatives, including incentive programs, grants, investment vehicles, and service providers, amounting to a total spend in the nine-figure USD range. While these allocations have driven significant growth and innovation, there has been minimal oversight or review of how these funds are ultimately used, and no system currently exists to incentivize the identification and reporting of fund misappropriation. Although three instances of misuse have been uncovered, it is likely that additional cases remain undetected.\n\nIn response, Entropy Advisors proposes the **establishment of a grant misuse bounty program dubbed “The Watchdog”** to incentivize the identification and reporting of misused DAO-allocated funds. The program would utilize an incentive mechanism to reward community contributors and investigators who submit verifiable reports of misappropriation. If the proposal passes a temperature check, Entropy will manage a selection process to determine a suitable platform to host the Watchdog program.\n\n## Motivation and Rationale\n\nBy offering financial rewards for valid reports of misappropriation, there will be a stronger motivation for community members to contribute skills or information that aid in identifying misconduct in the DAO. Today, the identification of wrongdoing can result in retaliation, unnecessary friction within the DAO, and other negative externalities for the investigators. Moreover, with no incentive to bring forth allegations, it is unlikely that most community members would do so. The Watchdog program creates a decentralized force of accountability, augmenting the DAO’s capacity to detect abuse that would likely otherwise go unnoticed while protecting the submitter from repercussions.\n\nArbitrum DAO’s successful identification of misappropriated funds, whether by a service provider, protocol, grant recipient, or anyone else that receives funds from Arbitrum DAO has two large benefits:\n\n1. The DAO (mainly through the Foundation, as it has done so in the [past](https://forum.arbitrum.foundation/t/stip-announcement-multisig-returns-leftover-funds/26383)) may be able to recapture some of the funds. This could involve legal avenues, smart contract enforcement (clawbacks / stream stopping), or community pressure.\n2. The evidence can be used to identify possible improvement opportunities in the underlying programs and make more informed decisions surrounding the recognized bad actors in the future.\n\nOther benefits include a mechanism for malicious action deterrence and bringing sophisticated onchain sleuths into the DAO.\n\nJust the existence of a transparent and well-publicized bounty program will likely deter some malicious actors from misusing DAO funds in the first place. Knowing that the community has the tools and incentives to identify misallocation increases the risk of exposure for those who might consider abusing the DAO’s trust. Recipients of DAO funds will need to think twice before acting maliciously or in a way that doesn’t align with the DAO’s strategic objectives, rules, and the broader interests of Arbitrum.\n\nBy allowing anyone to submit evidence-based reports of misuse anonymously, the program empowers the entire Arbitrum and crypto ecosystem to take an active role in maintaining the financial health and integrity of the Arbitrum DAO. We hope this fosters a culture of vigilance, good intentions, and accountability while bringing white-hat actors into the ecosystem.\n\n## Specifications\n\nThe Watchdog program will extend to ALL DAO-funded initiatives including end recipients of other programs such as the Questbook Domain program, Stylus Sprint, Arbitrum Foundation grants, and the incentives programs. The process for rewarding those who successfully identify fund misuse will start with a temporary solution utilizing a small committee of reviewers with a long-term plan for the program to eventually fall under OpCo, if and when it is stood up.\n\nEntropy proposes the following definition of misuse of funds:\n\n*Any action or inaction by a recipient of DAO-allocated funds that directly violates the stated terms, objectives, agreement, or overall spirit of the allocation under which those funds were provided.*\n\nMisuse definitions and examples below are included solely as a point of reference for the DAO and all decisions surrounding severity will be at the full discretion of the committee:\n\n* **Low:** Cases where there is minor misuse of DAO-allocated funds with limited impact on the DAO’s overall financial health, reputation, or strategic goals.\n  * Example: A Questbook domain allocator accidentally sent a double payment for a milestone and the recipient did not report it.\n  * Example: A grant recipient uses a portion of the funds for unauthorized purposes, such as non-DAO-aligned marketing, travel, or administrative overhead not included in the grant proposal.\n* **Medium:** Cases involving significant misuse of DAO-allocated funds that impact the DAO’s resources or strategic goals, but where the misuse is still recoverable, or partial results have been delivered.\n  * Example: An incentive program recipient uses funds in a way that does not benefit end users, but is a step away from outright theft and fraud.\n  * Example: A grant recipient diverts a significant portion of the funds (e.g., 50k+ ARB) to unrelated projects or personal use.\n* **High:** Cases involving large-scale, deliberate misuse of DAO-allocated funds.\n  * Example: A fund-recipient fabricates deliverables to obtain funds without working on the approved project, then disappears with the entire grant.\n  * Example 2: Theft or unauthorized transfers, such as if MSS members purposefully diverted funds to a recipient not eligible.\n\nThe workflow for Watchdog reports will be as follows:\n\n**1. Report Submission**\n\n* Anyone (watchers) can identify potential misuse of funds that originated from the DAO and submit an evidence-based report to a designated section on a to-be-determined bounty platform. Throughout the entire process, the identity of the submitter will remain private. As detailed further in step 3, the report will only be made public to the DAO in the instance that attempts at backchannel communications with the alleged party fail and a DAO ban is constituted or on a case-by-case basis where the committee deems it prudent to make the DAO aware of the misuse.\n* Reports will follow a standard template to help streamline the review process and collect the initial necessary information.\n\n**2. Review Process**\n\n* A whitelisted group of three DAO-associated reviewers will have the ability to review the submitted reports. We propose the group of initial reviewers to comprise the Arbitrum Foundation, Entropy Advisors, and the elected Research Member of the ARDC. This structure minimizes the operating costs of the program until OpCo is stood up., Entropy and the Arbitrum Foundation will be waiving payment as reviewers. The ARDC Research Member will be paid at their stated hourly rate, with funds coming from the ARDC V2 budget. We anticipate the review process for a Watchdog report to take a minimal amount of hours.\n* The three reviewers will discuss reports and, if required, contact the concerned party for clarifications. If two or more reviewers agree (at their discretion) that the submission is based on substance and misuse has occurred, the watcher(s) will receive the bounty. The reviewers will also determine the level of severity of the misuse (Low, Medium, High), which will impact the bounty reward as outlined in step 4.\n* In the case that 2 or more reviewers deem there has been fund misuse, the Arbitrum Foundation will open up private channels of communication with the concerned party and attempt to get the funds back for the DAO.\n* Reviewers are required to abstain from specific review processes if a conflict of interest (COI) is identified. If two or more reviewers have an identified COI, the reviewers will identify two external parties who don’t have COIs and have the capabilities to review the report. If the report is made public, the reviewers’ identified COIs will be published at the same time. To reduce the need for an additional election process and budgeted compensation, Entropy suggests utilizing the soon-to-be-elected Domain Allocators from the D.A.O. program, MSS members, and the other ARDC V2 members for the short list of trusted community members to step in if multiple COIs exist.\n\n**3. DAO Forum & Snapshot Voting**\n\n* If all attempts at backchanneling are failed, the report will be posted to the forum with all the watcher’s personal and identifiable information redacted in the version posted publicly. On a case by case basis, the committee may decide to post a summary of the report to inform the DAO of the misuse. Otherwise individual reports will not be posted to the forum directly. It is Entropy’s belief that in instances of low misuse, it is unwise to subject teams to public scrutiny for what could be a common or minor error.\n* The DAO will vote via Snapshot on whether or not the violation constitutes a DAO ban. Delegates can reference the Furucombo [instance](https://forum.arbitrum.foundation/t/potential-misuse-of-funds-furucombo/25496) as an example.\n* The Foundation will determine in which instance of legal recourse is viable. This will be dependent on the size of funds involved in the misuse and legal jurisdiction of the accused party.\n\n**4. Reward Mechanism**\n\n* If the review committee deems a report valid at their discretion, they will deem what level of misuse. A certain level of subjectivity has been introduced due to the wide range of programs that the Watchdog program will cover. A mix of factors will be taken into account the level of severity. These include, but are not limited to the total amount of funds involved, how the funds were used (ex. simple error or intentional fraud), if the misuse is rectifiable, and/or the level of damage to the Abitrum ecosystem/brand.\n  * **Low:** 1k ARB base payout + 5% of recovered funds capped at an additional $10k\n  * **Medium:** 10k ARB base payout + 5% of recovered funds capped at an additional $20k\n  * **High:** 30k ARB + 5% of recovered funds capped at an additional $100k\n* A fixed reward has been included to ensure that an incentive always exists for community members and individuals to submit reports. The base payouts denominated in ARB will come from the approved Watchdog budget.\n* If recaptured funds are denominated in a volatile asset, the maximum reward awarded to the watcher will be calculated as the 30D TWAP of the underlying asset on the day the transfer is made. For clarity, the reward is still paid out in the recovered asset.\n* While anyone is encouraged to submit reports, only watchers that complete a KYC with the Foundation will be eligible for rewards.\n* The program will run until the 400K ARB is exhausted from valid misuse reports. Once 100k ARB remains, a proposal will be put forward to the DAO to extend the budget or shut down the program.\n\nWe believe that this mechanism is optimal for the time being, but if/once OpCo is stood up, the program could be moved into its domain. If done so, the reviewer and voting mechanism would likely need to be restructured.\n\nThe expectation will be that 6 months post program launch, Entropy Advisors will raise a subsequent vote to the DAO in order to gauge the program's success. At this point the DAO can determine if the program should continue in its current state, be moved under OpCo if or when it is stood up, or if the program should be discontinued. Entropy will provide a retrospective report near the end of the 6-month trial to help the DAO evaluate the successfulness of the program. The report will summarize the received misuse cases along with data such as total amount of misuse, severity breakdowns, and amount of ARB recovered.\n\n### Steps to Implement: RFP Process\n\nIt will be necessary to create a secure platform where community members or contributors can privately submit their reports. This will ensure confidentiality and data security for all parties involved. With the requirements resembling a bug bounty program, we imagine that an existing platform can quickly build the necessary portal. If the proposal passes a temperature check, Entropy will directly contact potential providers and solicit bids that will be publicly posted in a dedicated subcategory in the forum. Delegates will have visibility into the bids, but Entropy will conduct negotiations, select the provider, and present a summary of the rationale to the DAO prior to the proposal moving to Tally. Unless the DAO feels strongly about being involved in the selection process, our team views this as the simplest and quickest route to choosing a provider. The Arbitrum Foundation will serve as the counterparty for the agreement.\n\nEntropy refrained from setting a maximum budget at this stage as to not publicly signal to interested providers what amount the DAO would be willing to pay. Additionally, depending on whether the portal needs to be built from scratch or simply added to an existing platform, the costs may vary greatly.\n\n## Budget\n\nIn total 400,000 ARB + the necessary amount of ARB for the selected bounty platform (determined by RFP process) will be sent to a new MSS multisig in order to facilitate the program.\n\n* 400,000 ARB available to reward valid Watchdog reports.\n* Amount of ARB necessary to build and host the Watchdog program. To be determined through a RFP process.\n\n## Timeline\n\nDecember 20th: Forum post\nJanuary 16th-23rd: Snapshot vote\nJanuary 24th : Procurement process begins\nTBD: Onchain Vote\nTBD: Program is launched\n\n## Voting Options\n\nWith the RFP process happening pre-Tally ratification, the Snapshot vote will be subjected to the non-constitutional quorum requirements of 3% of the votable token supply with a simple majority of votes in favor/abstain.\n\nIt will be a basic vote with FOR, AGAINST, and ABSTAIN as the three options.\n\n## Conflicts of Interest\n\nOutside of being placed as one of the three reviewers, Entropy does not have any other conflicts of interest to disclose as part of this proposal.",
                "discussion": "https://forum.arbitrum.foundation/t/the-watchdog-arbitrum-daos-grant-misuse-bounty-program/27978?u=entropy",
                "author": "0xb4c064f466931B8d0F637654c916E3F203c46f13",
                "quorum": 0,
                "quorumType": "default",
                "start": 1737069263,
                "end": 1737674063,
                "snapshot": 296176967,
                "choices": [
                    "For",
                    "Against",
                    "Abstain"
                ],
                "labels": [],
                "scores": [
                    148207700.47829875,
                    2753486.5211336967,
                    6421567.191665236
                ],
                "scores_total": 157382754.19109762,
                "scores_state": "final",
                "state": "closed",
                "strategies": [
                    {
                        "name": "erc20-votes",
                        "params": {
                            "symbol": "ARB",
                            "address": "0x912CE59144191C1204E64559FE8253a0e49E6548",
                            "decimals": 18
                        },
                        "network": "42161"
                    }
                ],
                "created": 1737069263,
                "updated": null,
                "votes": 3550,
                "privacy": "",
                "plugins": {},
                "flagged": false
            },
            {
                "id": "0xe52ab17d41249186c4dc54afdb481e120572102ad222d4e2af13a92791d72344",
                "ipfs": "bafkreiabo7d4qmifpm7kzgpe7w3xgbikrhqmrxc363ra6xuxlcpekdaooy",
                "space": {
                    "id": "arbitrumfoundation.eth",
                    "name": "Arbitrum DAO",
                    "avatar": "ipfs://bafkreiejp7kjzjm4mlck45xcfup5lha7wrgqlyghvrtvpjpu5sfb6rl2ei",
                    "network": "42161",
                    "admins": [],
                    "moderators": [
                        "0xd6ca0daa6115bdf4577f26c9fa88f048d15e3ef9"
                    ],
                    "symbol": "ARB",
                    "terms": null
                },
                "type": "weighted",
                "title": "Arbitrum D.A.O. Season 3 Elections - Gaming",
                "body": "On December 12, 2024, the Arbitrum D.A.O. Grant Program, Season 3, was [favorably voted](https://snapshot.org/#/s:arbitrumfoundation.eth/proposal/0x052d7e9872192f46bfb4e0a2aabd07035d0842811ca1c82d654307b5d96e2e25), marking the Arbitrum DAO’s decision to extend the grant program for a third iteration. This season will feature a year-long program, the addition of a fifth experimental domain (Orbit) alongside the four established domains (“New Protocols and Ideas,” “Education, Community Growth, and Events,” “Dev Tooling on One and Stylus,” and “Gaming”), and several quality-of-life improvements detailed in the [forum discussion](https://forum.arbitrum.foundation/t/non-constitutional-rfc-arbitrum-d-a-o-domain-allocator-offerings-grant-program-season-3/27584).\n\nFollowing a call for applications, elections for the four domains of the Arbitrum D.A.O. Grant Program are now open, with separate votes for each domain.\nThe full list of candidacies can be found here: https://forum.arbitrum.foundation/t/election-application-thread-arbitrum-d-a-o-domain-allocator-offerings-grant-program/27909\n\nWe encourage all Arbitrum Delegates to vote responsibly and in the best interests of the Arbitrum DAO.\n\n\n# Gaming\n\n* Flook: [link to the full application](https://forum.arbitrum.foundation/t/election-application-thread-arbitrum-d-a-o-domain-allocator-offerings-grant-program/27909/13) - [TG handle](https://t.me/Flook3)\n* Erezedor: [link to the full application](https://forum.arbitrum.foundation/t/election-application-thread-arbitrum-d-a-o-domain-allocator-offerings-grant-program/27909/16) - [TG handle](https://t.me/erezedor)",
                "discussion": "https://forum.arbitrum.foundation/t/election-application-thread-arbitrum-d-a-o-domain-allocator-offerings-grant-program/27909",
                "author": "0xd333Bc5c9670C9cEb18f9A2CF02C6E86807a8227",
                "quorum": 0,
                "quorumType": "default",
                "start": 1737043200,
                "end": 1737648000,
                "snapshot": 295714831,
                "choices": [
                    "Flook",
                    "Erezedor",
                    "Abstain"
                ],
                "labels": [],
                "scores": [
                    114196863.5434128,
                    43777477.00637113,
                    5243512.858478837
                ],
                "scores_total": 164146244.05676958,
                "scores_state": "final",
                "state": "closed",
                "strategies": [
                    {
                        "name": "erc20-votes",
                        "params": {
                            "symbol": "ARB",
                            "address": "0x912CE59144191C1204E64559FE8253a0e49E6548",
                            "decimals": 18
                        },
                        "network": "42161"
                    }
                ],
                "created": 1736953167,
                "updated": null,
                "votes": 3314,
                "privacy": "shutter",
                "plugins": {},
                "flagged": false
            },
            {
                "id": "0xb732d60fcf82a2cd739f94fb76e950734475f08ce7b588e801fae9736f46f636",
                "ipfs": "bafkreieqh6vfeed23r2ey2qqig62j4j3prh4ohhf5m4tctiavlwnwdr3yi",
                "space": {
                    "id": "apecoin.eth",
                    "name": "ApeCoin DAO",
                    "avatar": "ipfs://QmfVZLhH51S1G3UVFRZecXR5KbhS1CQ9RVbpgsqU25YG2C",
                    "network": "1",
                    "admins": [
                        "0xfa98d153324ff559c1ce413cb39fc2ae9a74bc28",
                        "0x7d208c8fb4b0cc8a735fce53959da487f309a17c"
                    ],
                    "moderators": [],
                    "symbol": "APE",
                    "terms": null
                },
                "type": "basic",
                "title": "AIP-529: Development and Enhancement of APE-BOT Discord Tipping Bot",
                "body": "### PROPOSAL DESCRIPTION\nI’d like to advance the development of APE-BOT, a tool designed to enable apes to tip any user on any Discord server leveraging the ApeChain ecosystem.\n\nAlthough it is still a prototype, the bot is already up and running and uses the Curtis testnet.\nOnce the mainnet has launched, it will be immediately available there too in it’s current state.\n\nYou can check it out and play with it on my Discord server or just invite it to yours:\n\nThe Ape Bot’s server: [The Ape Bot's server](https://discord.gg/H5ksJW7y58)\nAPE-BOT’s invite link: [https://bit.ly/477oFKg](https://bit.ly/477oFKg) (or just directly invite it from my server)\n\nThis app is different than most other tipping bots. Instead of a centralized database, it actually uses the ApeChain for every transaction.\nAlthough, I must point out that this is still “just” a tipping bot which means that wallets are auto generated for users and are kept on the server computer. It is not a fully fledged non-custodial wallet. However, I believe it is still a better option than those fully centralized bots out there.\nI’m also planning on building a function where you could import wallets to your account and sign every tip with MetaMask, making it more secure without the need for me to store user keys.\nI’d like to work on many more features for the bot and it’s security as well as to create a sustainable model for its long-term operation.\n\nKey developments will include improving overall security, integrating wallet functionalities with MetaMask, adding requested tokens automatically, enabling token creation, role staking, developing community games like poker, and perhaps transitioning it to a more reliable cloud hosting in the future.\n\nI’m requesting a grant so I can fully focus on this project.\nAs of right now I have very little time to work on it.\n\nI would like to also request the right to use the ApeCoin logo for the bot if possible.\n\n### BENEFIT TO APECOIN ECOSYSTEM\nAPE-BOT directly enhances the ApeCoin ecosystem by facilitating microtransactions and increasing community interaction. By enabling tipping within Discord, the bot encourages the use of ApeCoin between users unlike other bots that are using inner databases instead of the blockchain.\n\n**Every community needs a tipping bot. It makes the entire guild more fun and engaging. It’s the tool to create actual economy in these spaces and to keep them alive.**\n\nIt’s not only for tipping. You can reward the users for being in your guild and motivate them for staying active. You can reward your members for attending events or fulfilling any request you have come up with.\nSub-communities will emerge on the ApeChain with their very own tokens. It will be crucial for all of them to have a functioning tipping bot.\nThis will be a must-have tool for these groups to become successful.\n\nI’d like to create a secure and sustainable bot, that’ll keep bringing value to the ApeCoin community.\n\nThis investment is expected to lead to:\n- Increased engagement within the ApeCoin community.\n- A rise in ApeCoin transactions and circulation.\n- The creation of new use cases for ApeCoin within social environments.\n\nCURRENT LIST of AVAILABLE FEATURES:\n- Automatic wallet generation upon first use of the bot. (or if someone else tips you first)\n- “$address” command to view your generated address to be used to hold funds.\n- “$tip” command to tip one or multiple users as well as the ability to tip an entire @role by mentioning it. (example usage: $tip @Role 10 ape)\n- “$balance” for balance checking.\n- “$airdrop” is a popular command among similar bots that lets users join in on a fun, timed game where active participants can claim a share of the airdrop. It’s a great way to engage the community and reward activity (example usage: $airdrop 100 ape 10m)(for 10 minutes).\n- “$tokens” command to check currently available tokens for tipping.\n- “$withdraw” - withdrawing funds from the bot.\n\nTO DO:\n- Overall security. \nAlthough, having each account directly interact with the chain with their own wallet instead of using an inner database is better, it is still my server that’s generating your wallets and must keep them safe.\nThis will always remain as the default functionality for the bot even if the wallet import function is finally present.\nDiscord tipping bots must remain easy and convenient to use from the beginning. Although, options for other methods must be in place.\n- Performance enhancements to seamlessly serve any amount of requests.\n- Squashing bugs, general maintenance.\nPlenty of bugs to fix now and in the future too I’m sure.\n- Auto Token Addition.\nAt the beginning adding new tokens to the bot will be done manually by me upon request. If there are too many requests I might need to add a fee to that.\nThe best option however, would be to automate this part so the user would be able to add any token they wish. A small fee would still likely be needed to avoid spamming the system.\n- Role staking solution\nThis is a way to incentivize people to stake certain amounts of $APE or tokens in order to receive access to various Discord roles.\n- Games Integration.\nI’d like to integrate a poker game into the bot where stakes would be done either in $APE or any ApeChain token that is listed in the bot. I’m sure this would be an amazing addition.\n- Website Development\nA dedicated website would also be needed of course.\n- Business Model Development.\nExplore and implement self-sustainable revenue models for the bot. Fees will need to be introduced for some features.\n\nAt the moment, I’ve implemented a service fee of 5 cents per tx. This is just one idea of a business model to make the bot actually sustainable in the long run. However, this is subject to change and might very well be revised in the future based on community input.\nThe 5-cent flat fee is paid whenever a transaction-related command is used. If you’re creating an airdrop or tipping hundreds of users at once, the fee remains the same and does not multiply. The user is charged only once per command.\n\nPerhaps the poker game could have a fee for the house. The Mint and Swap future ideas could have an extra fee in place.\n\nFuture ideas:\n- Mint Tokens\nUsers could create tokens with the bot.\n- Token Swap\nMaking it easier and more convenient to swap tokens right inside the bot.\n- Cloud hosting\nIn case hosting the bot on dedicated hardware proves to be unreliable then I shall switch to cloud hosting instead.\n\n### OVERALL COST\n**Total amount requested from the ApeCoin Ecosystem Fund = $40,000.**\n\nA single lump sum payment of $40,000 USD has been requested.\n\nDevelopment: $30,000.\nAudit: $10,000.\n\nAs suggested, I have allocated an additional $10K to hire an auditor for two rounds of security testing.\nFor an application of this scale, this amount should suffice.\nThe first audit will take place after I have implemented security practices to the best of my abilities. The second audit will occur after most, if not all, of the planned features are in place. Any future audits should be covered by the bot’s revenue.\n\nThe grant would cover the entire development of the bot/app and allow for complete focus and dedication. The cost is calculated based on what I’d need to fully focus on this project for an entire year.\n\nAfter that the app must sustain itself by revenue generated from fees.\n\nThis will ensure that the project receives the attention it needs to succeed, ultimately benefiting the ApeCoin community by delivering a fully developed, secure and sustainable Discord Tipping Bot.\n\n### PROPOSAL\nLink to the full proposal: (https://forum.apecoin.com/t/aip-529-development-and-enhancement-of-ape-bot-discord-tipping-bot/25915)\n\n*The AIP implementation is administered by the Ape Foundation. Implementation may be immaterially or materially altered to optimise for security, usability, to protect APE holders, and otherwise to effect the intent of the AIP. Any material deviations from an AIP, as initially approved, will be disclosed to the APE holder community.*",
                "discussion": "https://forum.apecoin.com/t/aip-529-development-and-enhancement-of-ape-bot-discord-tipping-bot/25915",
                "author": "0x00Cef6B61fd57d481e569C64Ac5280736023de7F",
                "quorum": 1,
                "quorumType": "default",
                "start": 1738893600,
                "end": 1740016800,
                "snapshot": 21791300,
                "choices": [
                    "For",
                    "Against",
                    "Abstain"
                ],
                "labels": [],
                "scores": [
                    78350.21348009892,
                    149651.19647573633,
                    541.6368268107619
                ],
                "scores_total": 228543.04678264615,
                "scores_state": "pending",
                "state": "active",
                "strategies": [
                    {
                        "name": "erc20-balance-of",
                        "params": {
                            "symbol": "APE",
                            "address": "0x4d224452801aced8b2f0aebe155379bb5d594381",
                            "decimals": 18
                        },
                        "network": "1"
                    },
                    {
                        "name": "delegation",
                        "params": {
                            "symbol": "APE (delegated)",
                            "strategies": [
                                {
                                    "name": "erc20-balance-of",
                                    "params": {
                                        "symbol": "APE",
                                        "address": "0x4d224452801aced8b2f0aebe155379bb5d594381",
                                        "decimals": 18
                                    }
                                },
                                {
                                    "name": "erc20-votes",
                                    "params": {
                                        "symbol": "APE (staked)",
                                        "address": "0x0187Ae64E905b4FE7Dd1568a5642fbEf05E96e71"
                                    }
                                }
                            ]
                        },
                        "network": "1"
                    },
                    {
                        "name": "erc20-votes",
                        "params": {
                            "symbol": "APE (lock up)",
                            "address": "0xc6B740025485104987303E99DD2c54c1369FFe7B"
                        },
                        "network": "1"
                    },
                    {
                        "name": "erc20-votes",
                        "params": {
                            "symbol": "APE (staked)",
                            "address": "0x0187Ae64E905b4FE7Dd1568a5642fbEf05E96e71"
                        },
                        "network": "1"
                    },
                    {
                        "name": "erc20-votes",
                        "params": {
                            "symbol": "APE(BendDAO)",
                            "address": "0xd97420142211c0C8ACF6276e73d8B7A7b09386BB"
                        },
                        "network": "1"
                    },
                    {
                        "name": "erc20-votes",
                        "params": {
                            "symbol": "APE(Para)",
                            "address": "0x29E297cBfDBF0420c05b2c499AFe7F3c7AF816cd"
                        },
                        "network": "1"
                    },
                    {
                        "name": "eth-balance",
                        "params": {
                            "symbol": "APE"
                        },
                        "network": "33139"
                    },
                    {
                        "name": "delegation",
                        "params": {
                            "symbol": "APE",
                            "strategies": [
                                {
                                    "name": "eth-balance",
                                    "params": {
                                        "symbol": "APE"
                                    }
                                }
                            ],
                            "delegationSpace": "apecoin.eth",
                            "delegationNetwork": "1"
                        },
                        "network": "33139"
                    }
                ],
                "created": 1738891197,
                "updated": null,
                "votes": 279,
                "privacy": "",
                "plugins": {},
                "flagged": false
            }
        ]
    }
}